---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGuidKey.GetHashCode
source: html/41da953f-4cda-b0f3-cb34-a0016c7a07bc.htm
---
# Autodesk.Revit.DB.IFC.IFCGuidKey.GetHashCode Method

Returns the hash code for this IFCGuidKey

## Syntax (C#)
```csharp
public override int GetHashCode()
```

## Returns
A 32-bit signed integer hash code.